logs/benchmark_20250709_210138/h3_150ms_1pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 21:07:52
Delay: 150ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 2000 total requests
spawning thread #1: 5 total client(s). 2000 total requests
spawning thread #2: 5 total client(s). 2000 total requests
spawning thread #3: 5 total client(s). 2000 total requests
spawning thread #4: 5 total client(s). 2000 total requests
spawning thread #5: 5 total client(s). 2000 total requests
spawning thread #6: 5 total client(s). 2000 total requests
spawning thread #7: 5 total client(s). 2000 total requests
spawning thread #8: 5 total client(s). 2000 total requests
spawning thread #9: 5 total client(s). 2000 total requests
spawning thread #10: 5 total client(s). 2000 total requests
spawning thread #11: 5 total client(s). 2000 total requests
spawning thread #12: 5 total client(s). 2000 total requests
spawning thread #13: 5 total client(s). 2000 total requests
spawning thread #14: 5 total client(s). 2000 total requests
spawning thread #15: 5 total client(s). 2000 total requests
spawning thread #16: 5 total client(s). 2000 total requests
spawning thread #17: 5 total client(s). 2000 total requests
spawning thread #18: 5 total client(s). 2000 total requests
spawning thread #19: 5 total client(s). 2000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 502.98ms, 79526.34 req/s, 21.88MB/s
requests: 40000 total, 40000 started, 40000 done, 40000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 40000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 11.01MB (11542190) total, 8.24MB (8637806) headers (space savings 26.80%), 2.37MB (2480000) data
UDP datagram: 6843 sent, 11434 received
                     min         max         mean         sd        +/- sd
time for request:     1.35ms    316.40ms     58.11ms     72.13ms    86.47%
time for connect:    57.07ms     82.18ms     69.90ms     10.21ms    48.00%
time to 1st byte:    65.56ms    268.79ms     80.65ms     21.59ms    99.00%
req/s           :     797.46     4014.65     1592.83      918.72    79.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 18000 total requests
spawning thread #1: 5 total client(s). 18000 total requests
spawning thread #2: 5 total client(s). 18000 total requests
spawning thread #3: 5 total client(s). 18000 total requests
spawning thread #4: 5 total client(s). 18000 total requests
spawning thread #5: 5 total client(s). 18000 total requests
spawning thread #6: 5 total client(s). 18000 total requests
spawning thread #7: 5 total client(s). 18000 total requests
spawning thread #8: 5 total client(s). 18000 total requests
spawning thread #9: 5 total client(s). 18000 total requests
spawning thread #10: 5 total client(s). 18000 total requests
spawning thread #11: 5 total client(s). 18000 total requests
spawning thread #12: 5 total client(s). 18000 total requests
spawning thread #13: 5 total client(s). 18000 total requests
spawning thread #14: 5 total client(s). 18000 total requests
spawning thread #15: 5 total client(s). 18000 total requests
spawning thread #16: 5 total client(s). 18000 total requests
spawning thread #17: 5 total client(s). 18000 total requests
spawning thread #18: 5 total client(s). 18000 total requests
spawning thread #19: 5 total client(s). 18000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 22.32s, 16127.26 req/s, 4.45MB/s
requests: 360000 total, 360000 started, 360000 done, 359900 succeeded, 100 failed, 100 errored, 0 timeout
status codes: 359900 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 99.33MB (104154078) total, 74.29MB (77897044) headers (space savings 26.77%), 21.28MB (22313800) data
UDP datagram: 41622 sent, 84709 received
                     min         max         mean         sd        +/- sd
time for request:     7.69ms       1.54s    565.58ms    201.87ms    70.68%
time for connect:    72.36ms       1.26s    157.26ms    266.91ms    93.00%
time to 1st byte:    80.97ms       1.36s    186.44ms    280.68ms    93.00%
req/s           :     158.03      190.22      165.19        4.39    87.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 40000
Measurement Requests: 360000
End Time: 2025-07-09 21:08:20
CSV Log: /logs/benchmark_20250709_210138/h3_150ms_1pct.csv